In [1]:
import pandas as pd

sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj1 = pd.Series(sdata)
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj2 = pd.Series(sdata, index=states)
obj3 = pd.isnull(obj2)

In [4]:
import math
math.isnan(obj2['California'])

True

In [5]:
x = obj2['California']
obj2['California'] != x

True

In [6]:
obj2['California'] == None

False

In [11]:
import pandas as pd
d = {
    '1': 'Alice',
    '2': 'Bob',
    '3': 'Rita',
    '4': 'Molly',
    '5': 'Ryan'
}
S = pd.Series(d)
S

1    Alice
2      Bob
3     Rita
4    Molly
5     Ryan
dtype: object

In [15]:
S.iloc[0:3]

1    Alice
2      Bob
3     Rita
dtype: object

In [38]:
students = [
    {"Name": "Alice",
    "Class": "Physics",
    "Score": 85},
    {"Name": "Jack",
    "Class": "Chemistry",
    "Score": 82},
    {"Name": "Helen",
    "Class": "Biology",
    "Score": 90}
]
  
# Convert the dictionary into DataFrame  
df = pd.DataFrame(students, index = ["School1", "School2", "School3"])

In [39]:
df

          Name      Class  Score
School1  Alice    Physics     85
School2   Jack  Chemistry     82
School3  Helen    Biology     90

In [49]:
df.where(df['Score'] > 85)

          Name    Class  Score
School1    NaN      NaN    NaN
School2    NaN      NaN    NaN
School3  Helen  Biology   90.0

In [51]:
df[df['Score'] > 85]

          Name    Class  Score
School3  Helen  Biology     90

In [52]:
df.where(df['Score'] > 85).dropna()

          Name    Class  Score
School3  Helen  Biology   90.0

In [41]:
df.drop('School1')

          Name      Class  Score
School2   Jack  Chemistry     82
School3  Helen    Biology     90

In [42]:
df

          Name      Class  Score
School1  Alice    Physics     85
School2   Jack  Chemistry     82
School3  Helen    Biology     90

In [43]:
df.drop('Name', axis = 1)

             Class  Score
School1    Physics     85
School2  Chemistry     82
School3    Biology     90

In [44]:
df

          Name      Class  Score
School1  Alice    Physics     85
School2   Jack  Chemistry     82
School3  Helen    Biology     90

In [45]:
df.drop(['School1', 'School2'])

          Name    Class  Score
School3  Helen  Biology     90

In [46]:
df.drop('School3')

          Name      Class  Score
School1  Alice    Physics     85
School2   Jack  Chemistry     82

#### Suppose we have a DataFrame named df. We want to change the original DataFrame df in a way that all the column names are cast to upper case. Which of the following expressions is incorrect to perform the same?

In [71]:
students = [
    {"Name": "Alice",
    "Class": "Physics",
    "Score": 85},
    {"Name": "Jack",
    "Class": "Chemistry",
    "Score": 82},
    {"Name": "Helen",
    "Class": "Biology",
    "Score": 90}
]
  
# Convert the dictionary into DataFrame  
df = pd.DataFrame(students, index = ["School1", "School2", "School3"])

In [66]:
df

          Name      Class  Score
School1  Alice    Physics     85
School2   Jack  Chemistry     82
School3  Helen    Biology     90

In [55]:
# df = df.rename(mapper = lambda x: x.upper(), axis = 'columns') ###correct

In [63]:
# df.rename(mapper = lambda x: x.upper(), axis = 1, inplace = True)  ### idunno

In [72]:
df.rename(mapper = lambda x: x.upper(), axis = 1)
df

          Name      Class  Score
School1  Alice    Physics     85
School2   Jack  Chemistry     82
School3  Helen    Biology     90

In [73]:
df = df.rename(mapper = lambda x: x.upper(), axis = 1)
df

          NAME      CLASS  SCORE
School1  Alice    Physics     85
School2   Jack  Chemistry     82
School3  Helen    Biology     90

In [74]:
import pandas as pd
s1 = pd.Series({1: 'Alice', 2: 'Jack', 3: 'Molly'})
s2 = pd.Series({'Alice': 1, 'Jack': 2, 'Molly': 3})

In [75]:
s1.loc[1]

'Alice'

In [77]:
s2.iloc[1]

2

In [78]:
s2[1]

2

##### For the given DataFrame df shown above, we want to get all records with a toefl score greater than 105 but smaller than 115. Which of the following expressions is incorrect to perform the same?

In [80]:
students = [
    {"Name": "Alice",
    "Class": "Physics",
    "Score": 85},
    {"Name": "Jack",
    "Class": "Chemistry",
    "Score": 82},
    {"Name": "Helen",
    "Class": "Biology",
    "Score": 90}
]
  
# Convert the dictionary into DataFrame  
df = pd.DataFrame(students, index = ["School1", "School2", "School3"])
df

          Name      Class  Score
School1  Alice    Physics     85
School2   Jack  Chemistry     82
School3  Helen    Biology     90

In [81]:
(df["Score"] > 85) & (df["Score"] < 91)

School1    False
School2    False
School3     True
Name: Score, dtype: bool

In [83]:
df[df['Score'].gt(85) & df['Score'].lt(91)]

          Name    Class  Score
School3  Helen  Biology     90

In [85]:
df[(df['Score'] > 85) & (df['Score'] < 91)]

          Name    Class  Score
School3  Helen  Biology     90

In [86]:
df[(df['Score'].isin(range(85, 91)))]  # incorrect answer

          Name    Class  Score
School1  Alice  Physics     85
School3  Helen  Biology     90

In [87]:
df

          Name      Class  Score
School1  Alice    Physics     85
School2   Jack  Chemistry     82
School3  Helen    Biology     90

##### Which of the following is the correct way to extract all information related to the student named Alice from the DataFrame df given below:

In [ ]:
df.iloc['School1'] # incorrect

In [ ]:
df['Alice'] # incorrect

In [94]:
df.T['School1'] #correct

Name       Alice
Class    Physics
Score         85
Name: School1, dtype: object

In [ ]:
df['School1'] # incorrect